package project;

public class spec23 {
	
	
/* if문으로 이루어진 코드는 조건마다 각각 비교
 * 
 * 
 * 	
 */

// 조건문의 가장 단순한 형식 : if문
/*
 * 형식 : if(조건식) { 수행문; // 조건식이 참인 경우에 이 문장을 수행 }
 * 조건식은 결과가 참, 거짓으로 판변되는 식이다. 참, 거짓의 값을 가진 변수, 상수를 사용할 수 있다.
 * 
 * 
 * 조건문을 만족하는 경우와 만족하지 않는 경우를 모두 나타날 때 / if-else문 사용
 * 만약 ~이라면, 그렇지 않다면 
 * else문에 '조건식'을 사용하지 않는다
 * 
 * if [ 조건식 ] 
 * {
 * 수행문1; // 조건식이 참인 경우에 이 문장을 수행
 * }
 * else {
 * 수행문2; // 조건식이 거짓일 경우에 이 문장을 수행
 * }
 * 
 * 
 * 
 */
	
 //if-else문 
 
 //만약 나이가 8살 이상이면 학교에 다닌다, 그렇지 않으면 학교에 다닌다
	
public static void main(String[] args) {
	
int age = 7;
if(age >= 8) {
	
System.out.println("학교에 다닙니다");	
	
}
 
else {
	
System.out.println("학교에 다니지 않습니다");
}
 
	
}
	
	
	
}




	
	
	
	
	
	
	
	
	


